app/controllers/matters_controller.rb

  def index
    @matters = Matter.all
---
SELECT "matters".* FROM "matters"

  def show
    @matter = Matter.find(params[:id])
---
SELECT "matters".* FROM "matters" WHERE "matters"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @matter = Matter.new(params[:matter])

    if @matter.save
      #Matter.first(:order => "RANDOM()") #POSTGRES
      #Matter.first(:order => "RAND()") #SQL
      render :json => {:status => "File was uploaded successfuly!", :file => Matter.first(:order => "RANDOM()").file.url }
---
INSERT INTO "matters" ("created_at", "file_content_type", "file_file_name", "file_file_size", "file_updated_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "matters".* FROM "matters" ORDER BY RANDOM() LIMIT 1